<template>
  <div class="liv_his_all_wrap">
    <div class="liv_his_wrap">
      <div class="game_day_title_wrap_page">
        <div class="game_day_title_page">
          <div class="game_day_title_1_page">{{ currentNews.title }}</div>
        </div>
      </div>
      <div class="news_aut_wrap">
        <div class="news_cont_date">
          {{ currentNews.date }}
        </div>
        <div class="news_cont_author">
          {{ currentNews.author }}
        </div>
      </div>
      <div class="gallery_wrap_sub">
        <div class="swiper_border">
          <swiper
            :style="{
              '--swiper-navigation-color': '#fff',
              '--swiper-pagination-color': '#fff',
            }"
            :zoom="true"
            :navigation="true"
            :pagination="{
              clickable: true,
            }"
            :modules="modules"
            class="mySwiper"
          >
            <swiper-slide>
              <div class="swiper-zoom-container">
                <img :src="currentNews.image" :alt="currentNews.altText">
              </div>
            </swiper-slide>
          </swiper>
        </div>
        <div class="his_text">
          <p>{{ currentNews.text1 }}</p>
          <p>{{ currentNews.text2 }}</p>
          <p>{{ currentNews.text3 }}</p>
          <p>{{ currentNews.text4 }}</p>
          <p>{{ currentNews.text5 }}</p>
          <p>{{ currentNews.text6 }}</p>
          <p>{{ currentNews.text7 }}</p>
        </div>
      </div>
    </div>
  </div>
</template>
  
  <script>
  import { Swiper, SwiperSlide } from 'swiper/vue';
  import 'swiper/css';
  import 'swiper/css/zoom';
  import 'swiper/css/navigation';
  import 'swiper/css/pagination';
  import { Zoom, Navigation, Pagination } from 'swiper/modules';
  
  export default {
  components: {
    Swiper,
    SwiperSlide,
    },
    setup() {
      return {
        modules: [Zoom, Navigation, Pagination],
      };
    },
    data() {
      return {
        news: [
          {
            title: "[오피셜] 리버풀 새로운 NO.8 왔다…소보슬러이 영입",
            author: "강동훈 기자",
            date: "2023년 7월 03일",
            image: "/images/news_1.jpg",
            altText: "1번 뉴스기사",
            link: "",
            text1: "[골닷컴] 강동훈 기자 = 잉글랜드 프리미어리그(EPL) 리버풀이 ‘헝가리 특급’ 도미니크 소보슬러이(22)를 품으면서 올여름 두 번째 보강에 성공했다. 등번호는 ‘레전드’ 스티븐 제라드(43·잉글랜드)가 달았던 상징적인 ‘NO.8’을 배정받았다.",
            text2: "리버풀은 3일(한국시간) 구단 공식 홈페이지를 통해 “취업 허가(워크 퍼밋)를 받으면서 소보슬러이를 영입을 완료했다. 앞서 알렉시스 맥 앨리스터(24)에 이어 올여름 두 번째 영입”이라면서 “등번호는 8번을 달 것”이라고 발표했다.",
            text3: "유럽축구 이적시장 전문가 파브리지오 로마노 기자에 따르면 리버풀은 라이프치히에 이적 허용 금액(바이아웃)인 7,000만 유로(약 1,007억 원)를 지불하면서 합의한 것으로 전해졌다. 이로써 소보슬러이는 버질 반 다이크(31)와 다윈 누녜스(24)에 이어 역대 구단 최다 이적료(클럽 레코드) 3위에 오르게 됐다.",
            text4: "리버풀 유니폼을 입은 소보슬러이는 “정말 기쁘다. 이적이 성사되기 전까지 길었고, 기다리는 동안 힘들었다”면서 “결국 입단을 마쳤고, 지금 기분은 너무 행복하다. 빨리 경기를 뛰고 싶다. 앞으로가 너무 기대된다”고 소감을 전했다.",
            text5: "당초 리버풀은 지난주 초 소보슬러이와 접촉해 개인 합의를 마쳤지만, 라이프치히와 이적료 협상 과정에선 난항을 겪었다. 결국 ‘교착 상태’에 빠지자 칼을 빼 들었다. 지난 1일 바이아웃을 지불했다. 이후 최종 서명까지 ‘일사천리’로 진행하면서 영입을 마무리했다.",
            text6: "리버풀이 소보슬러이를 영입한 건 중앙 미드필더와 공격형 미드필더는 물론이고, 측면 미드필더까지 소화할 수 있는 다재다능한 유틸리티 플레이어인 점에서 매력을 느꼈기 때문이다. 여기다 위르겐 클롭(56·독일) 감독이 중요시하는 전방 압박 능력과 활동량, 에너지, 스피드를 갖춘 점도 높게 평가한 것 전해졌다.",
            text7: "리버풀은 2019~2020시즌 이후 EPL 우승과 멀어진 데다, 급기야 지난 시즌에는 7년 만에 4위 안에 들지 못하면서 유럽축구연맹(UEFA) 챔피언스리그(UCL) 진출권도 따내지 못했던 터라 올여름 공격적인 투자 속에 벌써 두 명을 품었다. 맥 앨리스터와 소보슬러이를 영입다. 하지만 여기서 멈추지 않고 추가 보강을 더 계획하고 있다.",
          },
          {
            title: "‘히어 위 고’ 리버풀 미쳤다…1010억 ‘헝가리 특급’ 영입",
            author: "강동훈 기자",
            date: "2023년 7월 01일",
            image: "/images/news_2.jpg",
            altText: "2번 뉴스기사",
            link: "",
            text1: "[골닷컴] 강동훈 기자 = 잉글랜드 프리미어리그(EPL) 리버풀이 단단히 이를 갈았다. 당장 지난 시즌 5위에 그치는 등 최근 몇 년간 우승 트로피를 들어 올리지 못하자 올여름 스쿼드를 보강하기 위해 적극적으로 움직이고 있다. 2선 어디서든 뛸 수 있는 다재다능한 미드필더 도미니크 소보슬러이(22·라이프치히)를 영입한다.",
            text2: "유럽축구 이적시장 전문가 파브리지오 로마노 기자는 1일(한국시간) 소셜네트워크서비스(SNS)를 통해 “리버풀은 소보슬러이를 영입한다. 이적 허용 금액(바이아웃)을 발동했다”며 “개인 합의는 동의했고, 곧 메디컬 테스트를 진행할 예정”이라며 특유의 ‘히어 위 고’ 문구와 함께 소식을 전했다.",
            text3: "로마노 기자에 따르면 리버풀은 라이프치히에 바이아웃 금액인 7,000만 유로(약 1,010억 원) 수준의 이적료를 지불하기로 합의했다. 이적이 성사된다면 소보슬러이는 버질 반 다이크(31)와 다윈 누녜스(24)에 이어 역대 구단 최다 이적료(클럽 레코드) 3위에 오르게 된다.",
            text4: "리버풀은 소보슬러이가 중앙 미드필더와 공격형 미드필더는 물론이고, 측면 미드필더까지 소화할 수 있는 다재다능한 유틸리티 플레이어인 점에서 매력을 느껴 영입한 것으로 보인다. 뿐만 아니라 위르겐 클롭(59·독일) 감독이 가장 중요시하는 전방 압박 능력과 활동량, 에너지, 스피드를 갖춘 점도 높게 평가한 것 전해졌다.",
            text5: "올여름 리버풀은 투자를 아끼지 않으면서 전력 보강에 집중하고 있다. 특히 2019~2020시즌 이후 잉글랜드 프리미어리그(EPL) 우승과 멀어진 데다, 급기야 지난 시즌에는 4위 안에 들지 못하면서 유럽축구연맹(UEFA) 챔피언스리그(UCL) 진출권도 따내지 못하자 스쿼드 개편을 위해 적극적인 투자를 예고한 상태다.",
            text6: "특히 리버풀은 성적이 부진한 주요 원인으로 빈약한 미드필더진을 꼽은 데다, 나비 케이타(28·베르더 브레메)와 앨릭스 옥슬레이드 체임벌린(29·무소속), 제임스 밀너(37·브라이튼 앤 호브 알비온)가 계약이 만료돼 떠나면서 중원의 뎁스가 얇아졌기 때문에 중원 보강에 집중하고 있다. 그 일환으로 지난달 초 ‘월드컵 위너’ 미드필더 알렉시스 맥 앨리스터(24)를 데려왔다.",
          },
          {
            title: "중원 보강에 진심인 리버풀…이적료 1,285억까지 올렸다",
            author: "강동훈 기자",
            date: "2023년 6월 28일",
            image: "/images/news_3.jpg",
            altText: "3번 뉴스기사",
            link: "",
            text1: "[골닷컴] 강동훈 기자 = 올여름 중원을 보강하는 데 집중하고 있는 리버풀이 이번에는 페데리코 발베르데(24·레알 마드리드)를 노리고 있다. 이적료를 무려 9,000만 유로(약 1,285억 원)까지 올릴 정도로 단순한 관심이 아니라 영입을 위해 적극적으로 움직이고 있다는 보도다.",
            text2: "영국 매체 '풋볼365'는 28일(한국시간) \"리버풀은 이번 여름 이적시장 때 적어도 한두 명의 미드필더를 추가로 더 영입할 계획\"이라며 \"현재 여러 후보를 관찰하고 있는 가운데서 발베르데를 영입하는 ‘깜짝’ 이적을 추진 중\"이라고 소식을 전했다.",
            text3: "보도에 따르면 리버풀은 지난 시즌 성적이 부진한 주요 원인으로 빈약한 미드필더진을 꼽은 데다, 앞서 지난달 나비 케이타(28)와 앨릭스 옥슬레이드 체임벌린(29), 제임스 밀너(37)가 계약이 만료돼 떠나면서 중원의 뎁스가 얇아졌기 때문에 중원 보강에 집중하고 있다.",
            text4: "리버풀은 특히 2019~2020시즌 이후 잉글랜드 프리미어리그(EPL) 우승과 멀어진 데다, 지난 시즌에는 5위에 그쳐 유럽축구연맹(UEFA) 챔피언스리그(UCL) 진출권도 따내지 못한 만큼 올여름 적극적인 투자를 예고했다. 그 일환으로 이달 초 ‘월드컵 위너’ 미드필더 알렉시스 맥 앨리스터(24)를 데려왔다. 그러나 여기서 그치지 않고 추가로 중원 보강에 나서겠다는 계획이다. 이런 가운데 발베르데를 노리고 있다.",
            text5: "특히 레알 마드리드가 최근 보루시아 도르트문트에서 활약하던 주드 벨링엄(19)을 영입한 데다, 루카 모드리치(37), 토니 크로스(33)와도 재계약을 체결한 터라 발베르데로서는 입지가 이전과는 달라질 것으로 전망되자 리버풀은 적극적으로 노리고 있다.",
            text6: "'풋볼365'는 \"리버풀은 벨링엄이 새롭게 합류하고, 모드리치와 크로스, 에두아르도 카마빙가(20), 오렐리앵 추아메니(23)까지 있는 상황 속에서 발베르데가 카를로 안첼로티(63·이탈리아) 감독의 구상에서 ‘후순위’로 밀려날 수 있다고 예상하며 영입을 추진 중\"이라며 \"당초 7,000만 유로(약 1,000억 원)를 제안했지만, 현재 9,000만 유로까지 이적료를 올렸다. 협상은 긍정적으로 진행되고 있다\"고 덧붙였다.",
            text7: "다만 변수는 리버풀이 레알 마드리드와 이적료 합의를 맺더라도 개인 합의를 이끌어내지 못할 것으로 전망되고 있다. 실제 발베르데는 마드리드에서의 생활에 만족감을 느끼고 있으며, 주전 경쟁에서도 우위를 점할 수 있다고 생각해 떠날 의사가 없는 것으로 알려졌다.",
          },
          {
            title: "[오피셜] 리버풀 새로운 NO.10…'월드컵 위너' 맥 앨리스터 영입",
            author: "강동훈 기자",
            date: "2023년 6월 09일",
            image: "/images/news_4.jpg",
            altText: "4번 뉴스기사",
            link: "",
            text1: "[골닷컴] 강동훈 기자 = 리버풀(잉글랜드)이 올여름 첫 번째 영입에 성공했다. '월드컵 위너' 미드필더 알렉시스 맥 앨리스터(24)를 영입했다. 특히 '에이스'를 상징하는 등번호 10번을 택하면서 벌써부터 많은 기대를 모으고 있다.",
            text2: "리버풀은 8일(한국시간) 공식 홈페이지를 통해 \"맥 앨리스터를 영입했다\"며 \"메디컬 테스트를 성공적으로 마쳤고, 올여름 첫 영입이 될 것\"이라고 발표했다. 이적료는 비공개지만, 현지 보도에 따르면 이적 허용 금액(바이아웃)을 지불했기 때문에 3,500만 파운드(약 570억 원)인 것으로 알려졌다. 계약기간은 5년이다.",
            text3: "이번 여름 대대적인 스쿼드 개편을 예고한 리버풀은 특히 중원 보강에 심혈을 기울였다. 앞서 나비 케이타(28)와 앨릭스 옥슬레이드 체임벌린(29), 제임스 밀너(37)가 계약 만료로 일제히 떠나면서 새 시즌에 활용할 자원이 한정적이었기 때문이다.",
            text4: "리버풀은 당초 주드 벨링엄(19·보루시아 도르트문트)을 원했지만, 영입 경쟁이 치열해지면서 이적료가 폭등하자 부담을 느껴 결국 철수했다. 대신 이적료가 저렴하거나, 자유계약(FA) 신분이 되는 미드필더를 노리는 쪽으로 선회했다. 그 결과 맥 앨리스터를 품었다.",
            text5: "실제 리버풀은 예상됐던 가격보다 저렴하게 영입했다. 맥 앨리스터는 잉글랜드 프리미어리그(EPL)에서 좋은 활약을 펼쳤고, 2022 국제축구연맹(FIFA) 카타르 월드컵에서 아르헨티나 축구대표팀 일원으로 우승을 차지하며 최근 몸값이 치솟았다. 이에 이적료는 최대 6,000만 파운드(약 980억)까지 거론됐다. 그러나 계약 조항에 따른 바이아웃을 지불하면서 이적료를 절반으로 줄였다.",
            text6: "맥 앨리스터는 \"위르겐 클롭(55·독일) 감독과 함께 하게 돼 기대된다. 월드컵 우승 이후 더 많은 트로피를 갖고 싶어졌다. 리버풀은 그것을 가능하게 해줄 클럽\"이라며 \"리버풀 같은 빅클럽에 있을 때 우승해야 한다. 최선을 다해 돕고 우승할 수 있도록 노력하겠다\"고 입단 소감을 전했다.",
            text7: "아르헨티나 국적의 미드필더 맥 앨리스터는 AA 아르헨티노스 주니어스(아르헨티나)에서 프로 데뷔해 3년간 활약한 후 2019년 1월 브라이튼 앤 호브 알비온(잉글랜드) 유니폼을 입으면서 유럽 무대에 발을 디뎠다. 이후 빼어난 활약상을 선보였고, 리버풀 입단까지 이뤄냈다.",
            text8: "남미 출신답게 그는 볼 컨트롤이나 개인기, 드리블 등 테크닉이 빼어나다. 여기다 패싱력과 킥력이 좋고, 축구 지능이 뛰어나 언제든지 공격 시에 위협적인 기회를 만들어낼 수 있다. 2선과 3선 미드필더 어디서든 뛸 수 있는 다재다능함까지 갖췄다."
          },
          {
            title: "리버풀 합류 후 단 '1경기' 출전…씁쓸한 '임대생활' 마친다",
            author: "강동훈 기자",
            date: "2023년 5월 09일",
            image: "/images/news_5.jpg",
            altText: "5번 뉴스기사",
            link: "",
            text1: "[골닷컴] 강동훈 기자 = 리버풀(잉글랜드) 미드필더 아르투르 멜루(26)가 이번 시즌이 끝나는 대로 유벤투스(이탈리아)로 다시 돌아간다. 지난해 여름 합류한 이래로 모든 대회 통틀어 단 한 경기밖에 뛰지 못한 채 씁쓸한 임대생활을 마친다.",
            text2: "멜루는 9일(한국시간) 본 매체(골닷컴) '글로벌 에디션'과의 독점 인터뷰를 통해 \"올여름 유벤투스로 다시 복귀할 예정\"이라며 \"리버풀에서 함께할 수 있어서 영광이었다. 지난 1년 동안 많은 것을 배웠다\"고 이같이 말했다.",
            text3: "앞서 멜루는 지난해 여름 이적시장 막바지에 리버풀 유니폼을 입었다. 유벤투스에서 방출 후보로 분류될 정도로 입지를 완전히 잃어버린 탓에 반등을 위한 새 길을 모색하면서 임대 이적으로 합류했다.",
            text4: "당시 그는 \"전 세계를 대표하는 명문 구단에 합류해서 기쁘다. 또, 세계 최고의 리그인 잉글랜드 프리미어리그(EPL)에서 뛰게 될 것을 생각하면 정말 기대되고 흥분된다\"면서 \"내 모든 걸 리버풀을 위해 바치겠다. 그라운드 안에서 내 꿈을 이어가겠다\"고 소감을 전했다.",
            text5: "멜루는 그러나 지난 2년간 유벤투스에서 오랜 시간 뛰지 못했던 터라 경기 감각이 많이 떨어져 있어 출전 기회를 받지 못했다. 거칠고 템포가 빠른 EPL 무대에 적응하는 데 어려움을 겪기도 했다. 실제 명단에서 제외되는 경우가 대부분이었던 그는 이번 시즌 공식전 단 1경기밖에 뛰지 못했다. 그마저도 교체로 들어가 13분을 소화하는 데 그쳤다.",
            text6: "사실상 전력 외나 다름없었던 멜루는 지난해 10월 초 허벅지 근육에 문제가 생기면서 전열에서 이탈했는데, 생각보다 부상이 심각해 결국 수술대에 올랐다. 이후 그는 회복과 치료, 재활에 전념했다. 지난 2월 복귀해 2군에서 실전 감각을 익혔지만, 아직 위르겐 클롭(55·독일) 감독의 부름을 받지 못하면서 모습을 드러내지 못했다. 이런 가운데 임대가 만료되면서 리버풀을 떠날 예정이다.",
            text7: "멜루는 \"리버풀에서의 시간은 이제 끝이 보인다\"면서 \"최근 부상에서 돌아오면서 뛰고 싶은 마음은 굴뚝같지만, 지난해 합류했을 때와 현재 상황이나 분위기가 많이 다르다는 것을 이해한다. 불만은 크게 없다. 다만 떠나기 전 마지막으로 작별 인사를 할 기회가 있으면 좋을 것\"이라고 말했다.",
          },
          {
            title: "리버풀 5연승 & 살라 8연속 홈경기 골... 토트넘 가고 맨유 나와!",
            author: "Alex Kim",
            date: "2023년 5월 04일",
            image: "/images/news_6.jpg",
            altText: "6번 뉴스기사",
            link: "",
            text1: "[골닷컴] 김형중 기자 = 프리미어리그 리버풀의 뒷심이 무섭다. 최근 연승 행진을 달리며 4위권을 맹추격했다.",
            text2: "리버풀은 4일 오전(한국시간) 영국 리버풀에 위치한 안필드에서 열린 2022/23 프리미어리그 34라운드 풀럼과의 홈 경기에서 1-0으로 신승했다. 전반 막판 모하메드 살라의 페널티킥 선제골이 그대로 결승골이 되었다. 승점 3점을 챙긴 리버풀은 5위 자리를 유지했다. 6위 토트넘을 승점 5점 차로 따돌렸고, 4위 맨체스터 유나이티드에는 승점 4점 차로 바짝 다가섰다.",
            text3: "리버풀은 최근 행보가 무섭다. 지난달 10일 아스널과 2-2로 무승부를 기록한 뒤, 5경기를 내리 이겼다. 리즈 유나이티드를 6-1로 대파한데 이어, 노팅엄 포레스트에 3-2, 웨스트햄에 2-1로 승리하고, 토트넘에 4-3 극적인 승리를 거뒀다. 이어 풀럼마저 격파하며 리그 5연승을 내달렸다. 2경기를 더 치르긴 했지만 4위 맨유를 승점 4점 차로 추격했다. 챔피언스리그 티켓도 보이기 시작했다.",
            text4: "올 시즌 한때 10위권 밖으로 밀려나며 지난 시즌 준우승 팀의 위용이 보이지 않았던 것을 생각하면 큰 반전이다. 리버풀은 최근 경기에서 공수 밸런스와 짜임새가 높아지며 경기력이 올라왔다. 실점이 조금 많긴 하지만, 그 이상의 득점포를 터트리며 승리를 따내고 있다. 이렇게 최근 5경기에서 차곡차곡 쌓은 승점 15점으로 어느새 4위 자리를 노리고 있다.",
            text5: "주포 모하메드 살라의 발끝도 뜨겁다. 살라는 이날 경기 페널티킥 골을 성공하며, 모든 대회 기준 최근 8번의 홈 경기에서 모두 득점포를 가동했다. 프리미어리그 기준으로는 7번 연속 홈 경기 득점이다. 지난 시즌 손흥민과 함께 공동 득점왕에 올랐지만 올 시즌 부진했던 살라는 이제 리그 18골로 득점 랭킹 4위에 올라있다.",
            text6: "지난 3월 맨유와의 26라운드에 들어서야 리그 두 자릿수 득점에 성공했지만 이후 9경기에서 7골을 퍼부으며 득점 감각을 끌어올렸다. 맨체스터 시티의 엘링 홀란의 독주로 득점왕에서는 멀어졌지만, 올 시즌도 20골 이상 득점은 무난할 것으로 보인다.",
            text7: "리버풀의 올 시즌 남은 일정은 브렌트포드, 레스터 시티, 아스톤 빌라, 사우샘프턴전이다. 리버풀의 상승세와 남은 4경기 결과가 챔피언스리그 출전권 싸움의 변수가 될 전망이다.",
          },
          {
            title: "'천정부지'로 치솟는 이적료 부담…리버풀 결국 영입 포기했다",
            author: "강동훈 기자",
            date: "2023년 4월 12일",
            image: "/images/news_7.jpg",
            altText: "7번 뉴스기사",
            link: "",
            text1: "[골닷컴] 강동훈 기자 = 올여름 중원 보강을 계획한 리버풀(잉글랜드)이 '최우선' 순위로 고려했던 주드 벨링엄(19·보루시아 도르트문트) 영입을 결국 포기하기로 결정했다. 영입전이 과열되면서 '천정부지'로 치솟는 이적료에 부담을 느낀 게 이유다.",
            text2: "본 매체(골닷컴) '글로벌 에디션'은 12일(한국시간) \"리버풀은 다가오는 여름 이적시장 때 벨링엄을 영입하고 싶었지만, 비용이 너무 많이 드는 탓에 불가능하다는 것을 받아들이기로 하면서 포기했다\"고 소식을 전했다.",
            text3: "유럽축구 이적시장 전문가 파브리지오 로마노 기자도 소셜네트워크서비스(SNS)를 통해 \"리버풀은 영국 현지에서 보도한 대로 벨링엄에 대한 관심을 중단했다\"면서 \"영입하지 않을 것이기 때문에 입찰에 나서지 않을 것\"이라고 보도했다.",
            text4: "당초 리버풀은 다가오는 여름 이적시장 때 대대적인 스쿼드 개편을 예고한 가운데 벨링엄을 영입할 계획이었다. 특히 나비 케이타(28)와 앨릭스 옥슬레이드 체임벌린(29) 등이 계약 만료로 떠나는 게 확정됐기 때문에 중원 보강이 필수적인 만큼 적극적이었다.",
            text5: "리버풀은 하지만 레알 마드리드(스페인)를 시작으로 맨체스터 시티와 맨체스터 유나이티드, 첼시(이상 잉글랜드), 파리 생제르맹(프랑스) 등 복수 구단이 영입전에 참전하면서 경쟁이 불이 붙음과 동시에 이적료가 폭등하자 부담을 느껴 결국 철수했다. 실제 최소 이적료로 무려 1억 3,000만 유로(약 1,880억 원)가 거론되는 중이다.",
            text6: "더구나 리버풀은 현재 잉글랜드 프리미어리그(EPL) 8위(승점 44)에 머무르고 있어 다음 시즌 유럽축구연맹(UEFA) 챔피언스리그(UCL) 진출권을 따내지 못할 가능성이 크다. 그 말인즉슨 이적료를 떠나 벨링엄을 설득하는 데 있어서 영입전에서 뒤처질 수밖에 없다. 이에 어쩔 수 없이 포기하는 쪽으로 굳혔다는 게 일부 전문가들의 주장이다.",
            text7: "대신 리버풀은 이적료가 저렴하거나, 자유계약(FA) 신분이 되는 미드필더를 노릴 계획이다. 대표적으로 거론되는 선수는 마테우스 누네스(24·울버햄튼 원더러스)와 소피앙 암라바트(26·피오렌티나), 유리 틸레만스(25·레스터 시티), 이브라힘 상가레(25·PSV 아인트호벤) 등이다. 여기다 최근 관심을 가진 오렐리앵 추아메니(23·레알 마드리드)도 있다.",
          },
          {
            title: "소유권 잃어버린 횟수만 22회…더는 위협적이지 않은 득점왕",
            author: "강동훈 기자",
            date: "2023년 4월 10일",
            image: "/images/news_8.jpg",
            altText: "8번 뉴스기사",
            link: "",
            text1: "[골닷컴] 강동훈 기자 = 모하메드 살라(30·리버풀)가 예전의 기량을 되찾는 듯했지만, 아직 부진의 늪에서 헤어나오지 못한 모양새다. 특히 공격 시에 특유의 저돌적인 돌파는 온데간데없고 도리어 소유권만 계속 잃어버리면서 아쉬운 모습만 보여주고 있다.",
            text2: "살라는 10일 오전 0시 30분(한국시간) 영국 리버풀의 안필드에서 열린 아스널과의 2022~2023시즌 잉글랜드 프리미어리그(EPL) 30라운드 홈경기에서 선발 출전해 풀타임을 소화했다.",
            text3: "이날도 어김없이 오른쪽 측면 공격수로 나선 살라는 전반 42분경 조던 헨더슨(32)의 패스를 건네받아 득점포를 가동하면서 만회골을 터뜨렸다. 하지만 활약은 거기까지였다. 전반 초반부터 아스널의 수비벽에 자주 막히면서 고전하던 그는 후반전에는 시종일관 소유권을 잃어버리며 도움이 되지 못했다.",
            text4: "실제 축구 통계 전문 매체 '소파 스코어'에 따르면 살라는 이날 소유권을 잃어버린 횟수가 무려 22회로 최다였다. 특히 공격 상황 때마다 불안정한 퍼스트터치와 무모한 돌파를 시도하다가 빼앗기면서 공격의 템포를 모조리 끊어먹었다.",
            text5: "살라는 설상가상 동점골을 만들 수 있는 '절호'의 찬스까지 놓치면서 안필드의 홈팬들을 실망시켰다. 후반 9분 페널티킥(PK) 찬스에서 키커로 나선 그는 골문 왼쪽 하단 구석에 꽂아 넣으려던 나머지 너무 꺾어 차면서 실축했다. 결국 유니폼으로 얼굴을 감싸면서 아쉬움을 삼켰다.",
            text6: "이 밖에도 살라는 이날 슈팅 무려 10회를 시도하는 동안 유효슈팅 3회에 그치면서 결정력이 떨어진 모습이었다. 다행히 교체 투입된 호베르투 피르미누(31)가 종료를 앞두고 승부를 원점으로 돌렸고, 치열했던 승부가 2-2 무승부로 끝난 탓에 조금이나마 비판을 덜 수 있었다.",
            text7: "살라는 지난 2017년 여름 리버풀에 합류한 이래 줄곧 맹활약을 펼치면서 '에이스'로 군림했다. 특히 2017~2018시즌(32골)과 2018~2019시즌(22골), 2021~2022시즌(23골) 득점왕에 오를 정도로 뛰어난 골 감각을 자랑했다.",
            text8: "하지만 이번 시즌은 초반부터 부진한 경기력 탓에 많은 비판을 받았다. 실제 2022 국제축구연맹(FIFA) 카타르 월드컵 전까지 EPL에서 6골에 그쳤다. 그의 침묵이 길어지면서 리버풀도 성적 부진 속에 중위권으로 떨어지는 등 위기에 놓였다.",
            text9: "살라는 다행히도 후반기 들어서 다시 예전의 기량을 조금씩 되찾아갔다. 지난달 EPL에서 두 자릿수 득점을 넘기는 등 분위기를 반전시켰다. 그러나 이날 경기에서 잦은 실책과 결정적 찬스를 놓치는 모습 등을 비추어봤을 때 확실하게 경기력이나 흐름을 되찾지 못한 모양새다.",
          },
          {
            title: "배신 당한 살라... 자택 절도범, 알고 보니 살라가 고용한 경비원이었다",
            author: "Alex Kim",
            date: "2023년 3월 16일",
            image: "/images/news_9.jpg",
            altText: "9번 뉴스기사",
            link: "",
            text1: "[골닷컴] 김형중 기자 = 리버풀 스타 모하메드 살라(31, 이집트)의 시련이 이어지고 있다. 이집트 자택이 절도범들에게 털렸는데, 알고 보니 그중 한 명은 자신이 직접 고용했던 세큐리티(경비원)이었다.",
            text2: "지난 12일(이하 한국시간) 이집트 카이로에 위치한 살라의 자택에 절도범들이 침입했다는 소식이 전해졌다. 다행히 집에는 아무도 없어 인명 피해는 없었다. 뒤늦게 돌아온 살라의 조카가 창문이 열려 있는 것을 수상히 여기고 경찰에 신고했다. 이 집은 살라가 이집트에 돌아가면 머무는 거처다.",
            text3: "15일 경찰 수사 끝에 범인들이 검거되었다. 그런데 절도범 중 한 명이 살라와 인연이 있는 인물이었다. 본 매체(골닷컴) 아랍 에디션에 따르면, 범인은 바로 살라가 고용한 경비원이었다. 그는 내부 상황에 익숙한 인물로 사전에 범행을 계획한 것으로 보인다. 살라 가족이 집에 없는 틈을 노리고 자신의 친구와 범행을 저질렀다고 전해졌다. 은혜를 원수로 갚은 것이다.",
            text4: "이집트 당국은 그들이 훔친 물건들을 모두 압수했다. 축구화와 운동화, 은 소재의 메달, 크리스탈 보석류, 그리고 텔레비전 수신기가 발견되었다.",
            text5: "살라로선 시련의 연속이다. 최근 프리미어리그 26라운드에서 라이벌 맨체스터 유나이티드를 7-0으로 대파하고 상승세를 탔지만, 11일 열린 27라운드 강등권 본머스전에서 충격패를 당했다. 살라는 페널티킥 마저 실축하며 패배의 주범으로 몰렸다. 바로 그 다음날 자택 절도를 당한 살라는 16일 새벽 열린 UEFA 챔피언스리그 16강 2차전에서 레알 마드리드에 패하며 8강 진출이 물거품 되었다.",
            text6: "연이은 경기 패배도 서러운데, 자신이 믿고 고용한 사람에게 배신까지 당한 살라다.",
          },
          {
            title: "각종 '대기록' 쏟아진 날…'노스웨스트 더비' 역대급 결과 나왔다",
            author: "강동훈 기자",
            date: "2023년 3월 06일",
            image: "/images/news_10.jpg",
            altText: "10번 뉴스기사",
            link: "",
            text1: "[골닷컴] 강동훈 기자 = 영국을 대표하는 라이벌 리버풀과 맨체스터 유나이티드가 맞붙은 '노스웨스트 더비'에서 역대급 결과가 나왔다. 동시에 각종 '대기록'도 쏟아지면서 전 세계 축구 팬들의 이목을 집중시켰다.",
            text2: "리버풀은 6일 오전 1시 30분(한국시간) 영국 리버풀에 위치한 안필드에서 열린 맨체스터 유나이티드와의 2022~2023시즌 잉글랜드 프리미어리그(EPL) 26라운드 홈경기에서 무려 7골을 뽑아내면서 대승을 거뒀다.",
            text3: "코디 각포와 다윈 누녜스, 모하메드 살라가 각각 멀티골을 완성했고, 여기다 호베르투 피르미누의 추가골까지 터졌다. 그야말로 '지옥의 원정'으로 불리는 안필드에서 맨유에 '대굴욕'을 선사했고, 각종 기록도 세웠다.",
            text4: "우선 리버풀은 1894년 '노스웨스트 더비'가 시작한 이래 처음으로 7골 차 대승을 거두면서 역대 최다 득점차 승리 기록을 새롭게 갈아치웠다. 반면 맨유는 1931년 울버햄튼 원더러스(1-8 패)와 1930년 아스톤 빌라(1-8 패), 1926년 블랙번 로버스(0-7 패) 이후 다시 한번 구단 역대 최다 점수 차 패배로 기록됐다. 당연히 에릭 텐 하흐 감독은 지도자 커리어 첫 7골 차 대패를 당했다.",
            text5: "개인 기록도 다양하게 쏟아졌다. '파라오의 왕' 살라가 EPL 기준 리버풀 최다 득점자로 등극했다. 종전까지 127골로 로비 파울러를 한 골 차로 추격했지만, 이날 멀티골을 뽑아내면서 넘어섰다. 6년 만이자 205경기째 만에 완성한 기록이다. 동시에 그는 모든 대회 통틀어 맨유 상대로 6경기 연속 득점한 최초의 리버풀 선수로 등극했다.",
            text6: "각포는 더비에서 '강한 사나이'로 등극했다. 리버풀 역사상 한 시즌에 안필드에서 '머지사이드 더비'와 '노스웨스트 더비' 때 득점한 다섯 번째 선수가 됐다. 2013~2014시즌 다니엘 스터리지가 기록한 이후 처음이다. 그는 더불어 누녜스와 함께 맨유를 상대로 '더블' 멀티골을 기록하며 역사를 썼다. 이는 1910년 아서 고다드와 제임스 스튜어트 이후 처음이다.",
            text7: "끝으로 살라와 각포, 누녜스는 EPL 역사상 네 번째로 한 경기에서 멀티골을 기록한 '트리오'가 됐다. 이는 1999년 맨유의 공격을 이끌었던 앤디 콜과 드와이트 요크, 올레 군나르 솔샤르가 달성한 이후 처음 있는 일이다.",
          },
        ],
        currentNewsIndex: 0,
      };
    },
    computed: {
    currentNews() {
    const index = parseInt(this.$route.params.index);
    return this.news[index];
  },
  },
  methods: {
    shareNews() {
      const { title, link } = this.currentNews;
      const shareText = `Check out this news: ${title} - ${link}`;

      if (navigator.share) {
        navigator.share({
          title: 'News Article',
          text: shareText,
          url: link,
        })
          .then(() => {
            console.log('News shared successfully');
          })
          .catch((error) => {
            console.error('Error sharing news:', error);
          });
      } else {
        
        console.log('Web Share API not supported');
        
      }
    },
    
  },
};
  </script>
<style scoped>
  *{
    list-style: none;
    margin:0 auto;
    padding:0;
    font-family: 'IBM Plex Sans KR', sans-serif;
  }
  a{
    text-decoration: none;
  }
  .liv_his_all_wrap{
    height: 100%;
    background: linear-gradient(to bottom right, #f6f6f6 50%, white 50%);
  }
  .liv_his_wrap{
    max-width: 1350px;
  }
  .game_day_title_wrap_page{
    max-width:1000px;
  }
  .game_day_title_page{
    font-size: 32px;
    max-height: 50px;
    /* height:100vh; */
    display: flex;
    align-items: center;
    justify-content: center;
    padding-top:10px;
    margin-left:50px;
    margin-right: 50px;
    font-weight: bold;
    margin-bottom: 40px;
    padding-top: 200px;
  }
  .news_aut_wrap{
    display: flex;
    justify-content: space-between;
    max-width: 1000px;
    width:100%;
    max-height:100px;
    height:100%;
    margin-top:80px;
  }
  .news_cont_date{
    margin-left:20px;
    display:flex;
    align-items: center;
    padding-bottom:20px;
  }
  .news_cont_author{
    margin-right:20px;
    display:flex;
    align-items: center;
    padding-bottom:20px;
  }
  .gallery_wrap_sub{
    max-width: 1100px;
  }
  .swiper_border img{
    border: 3px solid #b71515;
    box-shadow: 0px 8px 33px #999;
  }
  .his_text{
    margin-top:70px;
    line-height: 2rem;
    margin-left:20px;
    margin-right:20px;
  }
  .his_text p{
    margin-top:30px;
  }
</style>

